
# 1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа.
# Числа и знак операции вводятся пользователем. После выполнения вычисления программа не должна завершаться,
# а должна запрашивать новые данные для вычислений. Завершение программы должно выполняться при вводе символа '0'
# в качестве знака операции. Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'),
# то программа должна сообщать ему об ошибке и снова запрашивать знак операции.
# Также сообщать пользователю о невозможности деления на ноль, если он ввел 0 в качестве делителя.

while True:
    a = int(input("Введите первое число: "))
    b = int(input("Введите второе число: "))
    znak = input("Введите знак операции")
    if znak == '0':
        break
    elif znak == '+':
        print(a + b)
    elif znak == '-':
        print(a - b)
    elif znak == '*':
        print(a * b)
    elif znak == '/':
        if b != 0:
            print(a / b)
        else:
            print('деление на 0')
    else:
        print('некорректный знак операции')







